<!-- dflook/terraform-github-actions {"workspace":"destroy","backend_type":"remote","plan_modifier":"7315d26182c51d217d9e3d344cc810f7b40da8efea2eba56753ce5cdf71bad9f","backend":"a462bb8871508068888b2b3aac1422eb3920cc9f7190e0e41ef386de75f1d46e","plan_job_ref":"Job Test plan target and replace #319 at https://github.com/dflook/terraform-github-actions/actions/runs/4293606072","plan_hash":"4cc5291e6615bfe4f8837c1cb2354ad4c36a8359dd992437abf623760883926b","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __destroy__ workspace
:skull: Planning to destroy all resources
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "y1ob9ThDKz" -> (known after apply)
  ~ foreach = "XUcua13F2b" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #319](https://github.com/dflook/terraform-github-actions/actions/runs/4293606072)